module.exports = {
    Colorado: [
        601, // Colorado
        1496, // Colorado改
    ],

    Kongou: [
        78, // 金剛
        209, // 金剛改
        149, // 金剛改二
        591, // 金剛改二丙
    ],
    Hiei: [
        86, // 比叡
        210, // 比叡改
        150, // 比叡改二
    ],
    Haruna: [
        79, // 榛名
        211, // 榛名改
        151, // 榛名改二
    ],
    Kirishima: [
        85, // 霧島
        212, // 霧島改
        152, // 霧島改二
    ],

    Ise: [
        77, // 伊勢
        82, // 伊勢改
        553, // 伊勢改二
    ],
    Hyuuga: [
        87, // 日向
        88, // 日向改
        554, // 日向改二
    ],

    Fusou: [
        26, // 扶桑
        286, // 扶桑改
        411, // 扶桑改二
    ],
    Yamashiro: [
        27, // 山城
        287, // 山城改
        412, // 山城改二
    ],
};
