const {
    由良,
    由良改,
    由良改二,

    川内,
    川内改,
    川内改二,
    神通,
    神通改,
    神通改二,
    那珂,
    那珂改,
    那珂改二,

    夕張,
    夕張改,
    夕張改二,
    夕張改二特,
    夕張改二丁,

    阿賀野,
    阿賀野改,
    能代,
    能代改,
    能代改二,
    矢矧,
    矢矧改,
    矢矧改二,
    矢矧改二乙,
    酒匂,
    酒匂改,

    大淀,
    大淀改,

    Sheffield,
    Sheffield改,

    香取,
    香取改,
    鹿島,
    鹿島改,
} = require('../ship-ids');

module.exports = {
    // 轻巡洋舰
    Yura: [由良, 由良改, 由良改二],
    Sendai: [川内, 川内改, 川内改二],
    Jintsu: [神通, 神通改, 神通改二],
    Naka: [那珂, 那珂改, 那珂改二],
    Yuubari: [夕張, 夕張改, 夕張改二, 夕張改二特, 夕張改二丁],
    Agano: [阿賀野, 阿賀野改],
    Noshiro: [能代, 能代改, 能代改二],
    Yahagi: [矢矧, 矢矧改, 矢矧改二, 矢矧改二乙],
    Sakawa: [酒匂, 酒匂改],
    Ooyodo: [大淀, 大淀改],
    Sheffield: [Sheffield, Sheffield改],

    // 练习巡洋舰
    Katori: [香取, 香取改],
    Kashima: [鹿島, 鹿島改],
};
