const {
    赤城,
    赤城改,
    赤城改二,
    赤城改二戊,

    加賀,
    加賀改,
    加賀改二,
    加賀改二戊,
    加賀改二護,

    翔鶴,
    翔鶴改,
    翔鶴改二,
    翔鶴改二甲,

    瑞鶴,
    瑞鶴改,
    瑞鶴改二,
    瑞鶴改二甲,

    大鳳,
    大鳳改,

    祥鳳,
    祥鳳改,

    瑞鳳,
    瑞鳳改,
    瑞鳳改二,
    瑞鳳改二乙,

    飛鷹,
    飛鷹改,

    隼鷹,
    隼鷹改,
    隼鷹改二,
} = require('../ship-ids');

module.exports = {
    // 航母
    Akagi: [赤城, 赤城改, 赤城改二, 赤城改二戊],
    Kaga: [加賀, 加賀改, 加賀改二, 加賀改二戊, 加賀改二護],
    Souryuu: [90, 279, 197],
    Hiryuu: [91, 280, 196],
    Shoukaku: [翔鶴, 翔鶴改, 翔鶴改二, 翔鶴改二甲],
    Zuikaku: [瑞鶴, 瑞鶴改, 瑞鶴改二, 瑞鶴改二甲],
    Taihou: [大鳳, 大鳳改],

    // 轻型航母
    Shouhou: [祥鳳, 祥鳳改],
    Zuihou: [瑞鳳, 瑞鳳改, 瑞鳳改二, 瑞鳳改二乙],
    Hiyou: [飛鷹, 飛鷹改],
    Junyou: [隼鷹, 隼鷹改, 隼鷹改二],
};
