/**
 * @module
 * 装备额外属性收益
 *
 * 506. 電探装備マスト(13号改+22号電探改四)
 *      https://wikiwiki.jp/kancolle/%E9%9B%BB%E6%8E%A2%E8%A3%85%E5%82%99%E3%83%9E%E3%82%B9%E3%83%88%2813%E5%8F%B7%E6%94%B9%EF%BC%8B22%E5%8F%B7%E9%9B%BB%E6%8E%A2%E6%94%B9%E5%9B%9B%29
 *
 */

require('../../../../typedef');

const {
    潮改二,
    Верный,
    初霜改二,
    白露改二,
    時雨改三,
    霞改二,
    霞改二乙,
    雪風改二,
    天津風改二,
    磯風乙改,
    浜風乙改,
    朝霜改二,
    涼月改,
    冬月改,
} = require('../../ship-ids');

// ============================================================================

/** @type {Array<EquipmentBonus>} */
const _13号改_22号電探改四 = [
    {
        equipment: 506,
        ship: {
            isID: [時雨改三],
        },
        bonus: {
            fire: 2,
            aa: 2,
            evasion: 4,
            hit: 3,
        },
    },
    {
        equipment: 506,
        ship: {
            isID: [白露改二, 雪風改二, 天津風改二, 磯風乙改, 浜風乙改],
        },
        bonus: {
            fire: 1,
            aa: 1,
            evasion: 3,
            hit: 2,
        },
    },
    {
        equipment: 506,
        ship: {
            isID: [
                潮改二,
                Верный,
                初霜改二,
                霞改二,
                霞改二乙,
                朝霜改二,
                涼月改,
                冬月改,
            ],
        },
        bonus: {
            fire: 1,
            aa: 1,
            evasion: 2,
            hit: 1,
        },
    },
];

// ============================================================================

module.exports = [..._13号改_22号電探改四];
