module.exports = {
    // 战列舰
    Battleships: [
        8,
        6,
        20,
        7,
        18
    ],
    // 航母
    Carriers: [
        9,		// 轻型航母
        10,		// 正规航母
        11,		// 装甲航母
        30,		// 攻击型轻航母
        32      // 特设航母
    ],
    // 重巡
    HeavyCruisers: [
        4,		// 重巡洋舰
    ],
    // 轻巡
    LightCruisers: [
        2,		// 轻巡洋舰
        3,		// 重雷装巡洋舰
        21,		// 练习巡洋舰
        28		// 防空轻巡洋舰
    ],
    // 驱逐舰
    Destroyers: [
        1,		// 驱逐舰
        19		// 防空驱逐舰
    ],
    // 潜艇
    Submarines: [
        13,		// 潜艇
        14		// 航母潜艇
    ],
    // 水上机母舰
    SeaplaneTenders: [
        12,		// 水上机母舰
        24		// 飞行艇母舰
    ]
}