module.exports = {
    // 战列舰
    Battleships: [
        8,
        6,
        20,
        7,
        18,
        33, // 改装航空战列舰 / 战斗航空母舰
    ],
    // 航母
    Carriers: [
        9, // 轻型航母
        10, // 正规航母
        11, // 装甲航母
        30, // 攻击型轻航母
        32, // 特设航母
    ],
    // 航巡
    AviationCruisers: [
        36, // 改装航空巡洋舰
        5, // 航空巡洋舰
    ],
    // 重巡
    HeavyCruisers: [
        4, // 重巡洋舰
        23,
    ],
    // 轻巡
    LightCruisers: [
        2, // 轻巡洋舰
        3, // 重雷装巡洋舰
        21, // 练习巡洋舰
        34, // 轻航空巡洋舰
        35, // 兵装实验轻巡
        28, // 防空巡洋舰
    ],
    LightCruisersNoCT: [
        2, // 轻巡洋舰
        3, // 重雷装巡洋舰
        34, // 轻航空巡洋舰
        35, // 兵装实验轻巡
        28, // 防空巡洋舰
    ],
    // 轻巡
    TrainingCruisers: [
        21, // 练习巡洋舰
    ],
    // 驱逐舰
    Destroyers: [
        1, // 驱逐舰
        19, // 防空驱逐舰
    ],
    // 海防舰
    Escorts: [31],
    // 潜艇
    Submarines: [
        13, // 潜艇
        14, // 航母潜艇
    ],
    // 水上机母舰
    SeaplaneTenders: [
        12, // 水上机母舰
        24, // 飞行艇母舰
    ],
};
