module.exports = {
    大和: 131,
    大和改: 136,
    大和改二: 911,
    大和改二重: 916,
    武蔵: 143,
    武蔵改: 148,
    武蔵改二: 546,

    伊勢: 77,
    伊勢改: 82,
    伊勢改二: 553,
    日向: 87,
    日向改: 88,
    日向改二: 554,

    扶桑改二: 411,
    山城改二: 412,

    長門改二: 541,
    陸奥改二: 573,

    金剛: 78,
    金剛改: 209,
    金剛改二: 149,
    金剛改二丙: 591,
    比叡: 86,
    比叡改: 210,
    比叡改二: 150,
    比叡改二丙: 592,
    榛名: 79,
    榛名改: 211,
    榛名改二: 151,
    榛名改二乙: 593,
    榛名改二丙: 954,
    霧島: 85,
    霧島改: 212,
    霧島改二: 152,

    'South Dakota': 602,
    'South Dakota改': 697,

    Washington: 654,
    Washington改: 659,

    Richelieu: 492,
    Richelieu改: 392,
    'Jean Bart': 935,
    'Jean Bart改': 724,

    'Conte di Cavour nuovo': 879,
};
