module.exports = {
    天龍: 51,
    天龍改: 213,
    天龍改二: 477,

    龍田: 52,
    龍田改: 214,
    龍田改二: 478,

    // 球磨
    // 多摩

    北上: 25,
    北上改: 58,
    北上改二: 119,

    大井: 24,
    大井改: 57,
    大井改二: 118,

    // 木曽
    // 長良

    五十鈴: 22,
    五十鈴改: 219,
    五十鈴改二: 141,

    // 名取

    由良: 23,
    由良改: 220,
    由良改二: 488,

    鬼怒: 113,
    鬼怒改: 289,
    鬼怒改二: 487,

    // 阿武隈
    // 川内
    // 神通

    那珂: 56,
    那珂改: 224,
    那珂改二: 160,

    夕張: 115,
    夕張改: 293,
    夕張改二: 622,
    夕張改二特: 623,
    夕張改二丁: 624,

    //
    //

    Gotland: 574,
    Gotland改: 579,
    'Gotland andra': 630,
};
