module.exports = {
    天龍: 51,
    天龍改: 213,
    天龍改二: 477,

    龍田: 52,
    龍田改: 214,
    龍田改二: 478,

    球磨: 99,
    球磨改: 215,
    球磨改二: 652,
    球磨改二丁: 657,

    // 多摩

    北上: 25,
    北上改: 58,
    北上改二: 119,

    大井: 24,
    大井改: 57,
    大井改二: 118,

    // 木曽
    // 長良

    五十鈴: 22,
    五十鈴改: 219,
    五十鈴改二: 141,

    // 名取

    由良: 23,
    由良改: 220,
    由良改二: 488,

    鬼怒: 113,
    鬼怒改: 289,
    鬼怒改二: 487,

    // 阿武隈

    川内: 54,
    川内改: 222,
    川内改二: 158,
    神通: 55,
    神通改: 223,
    神通改二: 159,
    那珂: 56,
    那珂改: 224,
    那珂改二: 160,

    夕張: 115,
    夕張改: 293,
    夕張改二: 622,
    夕張改二特: 623,
    夕張改二丁: 624,

    阿賀野: 137,
    阿賀野改: 305,
    能代: 138,
    能代改: 306,
    能代改二: 662,
    矢矧: 139,
    矢矧改: 307,
    矢矧改二: 663,
    矢矧改二乙: 668,
    酒匂: 140,
    酒匂改: 314,

    大淀: 183,
    大淀改: 321,

    //
    //

    Gotland: 574,
    Gotland改: 579,
    'Gotland andra': 630,

    Sheffield: 514,
    Sheffield改: 705,

    //
    //

    香取: 154,
    香取改: 343,
    鹿島: 465,
    鹿島改: 356,
};
