/**
 * @module
 * 装备额外属性收益
 *
 * 213. 後期型艦首魚雷(6門)
 *      https://wikiwiki.jp/kancolle/%E5%BE%8C%E6%9C%9F%E5%9E%8B%E8%89%A6%E9%A6%96%E9%AD%9A%E9%9B%B7%286%E9%96%80%29
 *
 */

// const { I47, I58, I400, I401 } = require('../../ship-series');

// ============================================================================

// const 単体ボーナス = [];

// ============================================================================

const 相互シナジーボーナス = [
    // + 後期型潜水艦搭載電探＆逆探
    {
        list: [213, 384],
        equipments: [{ isID: 213 }, { isID: 384 }],
        ship: {
            isType: [
                13, // SS
                14, // SSV
            ],
        },
        bonus: {
            torpedo: 3,
            evasion: 2,
        },
    },
];

// ============================================================================

module.exports = [
    // ...単体ボーナス,
    ...相互シナジーボーナス,
];
