module.exports = {
    ReconSeaplanes_零式水上観測機: [
        59, // 零式水上観測機
    ],
    ReconSeaplanes_零式水上偵察機11型乙: [
        238, // 零式水上偵察機11型乙
        239, // 零式水上偵察機11型乙(熟練)
    ],
    SeaplaneBombers_IJN_Low: [
        26, // 瑞雲
        207, // 瑞雲(六三一空)
        79, // 瑞雲(六三四空)
        80, // 瑞雲12型
        81, // 瑞雲12型(六三四空)
        62, // 試製晴嵐
        208, // 晴嵐(六三一空)
    ],
    SeaplaneBombers_IJN_High: [
        237, // 瑞雲(六三四空／熟練)
        322, // 瑞雲改二(六三四空)
        323, // 瑞雲改二(六三四空／熟練)
        490, // 試製 夜間瑞雲(攻撃装備)
    ],
    Radars_USN: [
        307, // GFCS Mk.37
        315, // SG レーダー(初期型)
        456, // SG レーダー(後期型)
        278, // SKレーダー
        279, // SK＋SGレーダー
    ],
};
